onec/configuration/Catalogs/ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛицевыеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешнийID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

onec/configuration/Catalogs/Начисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Начисления</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешнийID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКопеек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

onec/configuration/Catalogs/Платежи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Платежи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешнийID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКопеек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

onec/configuration/HTTPServices/ReconciliationAPI/Ext/Module.bsl
// Возвращает лицевые счета в формате контракта.Функция GetAccounts(Запрос)	Данные = Новый Массив;	ЗапросДанных = Новый Запрос;	ЗапросДанных.Текст =	"ВЫБРАТЬ	|	ЛицевыеСчета.ВнешнийID КАК ВнешнийID,	|	ЛицевыеСчета.НомерСчета КАК НомерСчета	|ИЗ	|	Справочник.ЛицевыеСчета КАК ЛицевыеСчета	|ГДЕ	|	НЕ ЛицевыеСчета.ПометкаУдаления";	Выборка = ЗапросДанных.Выполнить().Выбрать();	Пока Выборка.Следующий() Цикл		Запись = Новый Структура;		Запись.Вставить("id", Выборка.ВнешнийID);		Запись.Вставить("account_number", Выборка.НомерСчета);		Данные.Добавить(Запись);	КонецЦикла;	Возврат СоздатьJSONОтвет(Данные);КонецФункции// Возвращает начисления. Суммы передаются целым числом копеек.Функция GetCharges(Запрос)	Данные = Новый Массив;	ЗапросДанных = Новый Запрос;	ЗапросДанных.Текст =	"ВЫБРАТЬ	|	Начисления.ВнешнийID КАК ВнешнийID,	|	Начисления.ЛицевойСчет.ВнешнийID КАК ВнешнийIDСчета,	|	Начисления.Период КАК Период,	|	Начисления.СуммаКопеек КАК СуммаКопеек	|ИЗ	|	Справочник.Начисления КАК Начисления	|ГДЕ	|	НЕ Начисления.ПометкаУдаления";	Выборка = ЗапросДанных.Выполнить().Выбрать();	Пока Выборка.Следующий() Цикл		Запись = Новый Структура;		Запись.Вставить("id", Выборка.ВнешнийID);		Запись.Вставить("account_id", Выборка.ВнешнийIDСчета);		Запись.Вставить("period", Выборка.Период);		Запись.Вставить("amount_kopecks", Выборка.СуммаКопеек);		Данные.Добавить(Запись);	КонецЦикла;	Возврат СоздатьJSONОтвет(Данные);КонецФункции// Возвращает платежи с датой в формате YYYY-MM-DD.Функция GetPayments(Запрос)	Данные = Новый Массив;	ЗапросДанных = Новый Запрос;	ЗапросДанных.Текст =	"ВЫБРАТЬ	|	Платежи.ВнешнийID КАК ВнешнийID,	|	Платежи.ЛицевойСчет.ВнешнийID КАК ВнешнийIDСчета,	|	Платежи.ДатаПлатежа КАК ДатаПлатежа,	|	Платежи.СуммаКопеек КАК СуммаКопеек	|ИЗ	|	Справочник.Платежи КАК Платежи	|ГДЕ	|	НЕ Платежи.ПометкаУдаления";	Выборка = ЗапросДанных.Выполнить().Выбрать();	Пока Выборка.Следующий() Цикл		Запись = Новый Структура;		Запись.Вставить("id", Выборка.ВнешнийID);		Запись.Вставить("account_id", Выборка.ВнешнийIDСчета);		Запись.Вставить(			"date",			Формат(Выборка.ДатаПлатежа, "ДФ=yyyy-MM-dd")		);		Запись.Вставить("amount_kopecks", Выборка.СуммаКопеек);		Данные.Добавить(Запись);	КонецЦикла;	Возврат СоздатьJSONОтвет(Данные);КонецФункции// Все методы возвращают одинаковую оболочку: {"value": [...]}.Функция СоздатьJSONОтвет(Данные)	ТелоОтвета = Новый Структура;	ТелоОтвета.Вставить("value", Данные);	ЗаписьJSON = Новый ЗаписьJSON;	ЗаписьJSON.УстановитьСтроку();	ЗаписатьJSON(ЗаписьJSON, ТелоОтвета);	СтрокаJSON = ЗаписьJSON.Закрыть();	Ответ = Новый HTTPСервисОтвет(200);	Ответ.Заголовки.Вставить(		"Content-Type",		"application/json; charset=utf-8"	);	Ответ.УстановитьТелоИзСтроки(СтрокаJSON);	Возврат Ответ;КонецФункции
